[
  {
    "url": "http://www.justanswer.com/relationship/6k30g-free-chat.html",
    "posts": [
      {
        "userName": "CoachJenK",
        "postTime": "1334958417",
        "chatCustomer": [
          "I have to go pick up crazy kiddos then, but maybe we can connect over the weekend. No emergency!",
          "You know I understand! And, as I said, just need advice, not a dire situation. Appreciate you!",
          "Hehehe...talk later."
        ],
        "title": "Expert",
        "chatExpert": [
          "Hi.  i will be in one hour. can you wait for me?",
          "Ok am also around this evening so feel free to find me then. am so sorry that can be here for you right now. typing from my phone and that can only work well for so long. :-)",
          "Ok go write a chapter or two of 51 shades and then well talk."
        ],
        "content": "",
        "accepted": "Accepted Answer"
      }
    ],
    "question": {
      "category": "Relationship",
      "status": "CLOSED",
      "title": "Are you free to chat?",
      "value": "$20",
      "content": "Are you free to chat?",
      "submitTime": "289 days and 4 hours ago.",
      "optionalInfo": "Already Tried: For CoachJenK"
    }
  },
  {
    "url": "http://www.justanswer.com/smartphones/6vmgp-iphone-3g-will-not-turn-on-plug-charger.html",
    "posts": [
      {
        "userName": "namstech",
        "postTime": "1341571618",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "My name is and I am looking forward to help you with your problem. Please try these steps.If this doesn't help, please reply back and we will try other options.If this helps and you are satisfied, you can rate the answer accordingly.Thanks If your Iphone has any protective cover, remove it. Plug in your Iphone for charging. Press and hold Home button and power button (for at least 15 seconds) until Apple logo appears and then release.",
        "accepted": []
      },
      {
        "userName": [],
        "postTime": "1341575218",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "Pressing the home and power button together displays the battery with the red line and the charging icon. After 8-10 secs the screen flashes and goes blank. If I keep holding the buttons the battery with red line and charging icon reappears after 20 sec. Never do I see the apple icon.",
        "accepted": []
      },
      {
        "userName": "namstech",
        "postTime": "1341575218",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "Is your Iphone still under warranty?",
        "accepted": []
      },
      {
        "userName": [],
        "postTime": "1341575218",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "No :-(",
        "accepted": []
      },
      {
        "userName": "namstech",
        "postTime": "1341575218",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "I see.Try restoring your Iphone using Itunes as follows:1. Connect Iphone to computer using USB cable.2. Open Itunes program on your computer.3. On Iphone, press Home and Power button on the same time and release the power button after 10 seconds but continue to hold Home button until Itunes shows it has detected Iphone in recovery mode.4. Click OK to restore.I hope this helps.",
        "accepted": []
      },
      {
        "userName": [],
        "postTime": "1341578818",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "Done that iTunes saw the phone and restored it but when it goes to restart it only has the battery with the red stripe. What next?Just tried it again and an itunes message says the phone should appear in the itunes window when it restarts. It never appears.Instead of the normal restart with the apple icon all that happens is the battery with the red strip appears for 3-4 secs then phone goes blank and doesn't appear in itunes!",
        "accepted": []
      },
      {
        "userName": "namstech",
        "postTime": "1341582418",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "Hi again.Sorry about the problem. I will opt out for other experts to have a look. As soon as one of my fellow experts are ready to help, you will receive a reply.Thanks for your patience.Regards",
        "accepted": []
      },
      {
        "userName": "Kriptokrit",
        "postTime": "1341582418",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "Can you please try this:1. Charge your phone for 10 minutes.2. After 10 minutes, while phone is still on charge, the Sleep/Wake button and the Home button at the same time for at least 25 seconds (until the Apple logo appears).* Check the picture below - Kind regards,Todd",
        "accepted": []
      },
      {
        "userName": [],
        "postTime": "1341596818",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "Hi, tried that but the Apple logo does not appear. After 8-10 secs the screen flashes and goes blank. If I keep holding the buttons the battery with red line and charging icon reappears after 20 sec. Never do I see the apple icon.",
        "accepted": []
      },
      {
        "userName": "Kriptokrit",
        "postTime": "1341596818",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "Hi,Thanks for the reply. Looks like that battery is flat, are you able to connect your phone to computer?If yes, connect phone to computer via USB cable for 20 minutes, then reset your phone (home + sleep/wake button at the same time).Please let me know if that works. If not, I'll provide you with the next step.Thank you.",
        "accepted": []
      },
      {
        "userName": [],
        "postTime": "1341596818",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "I have connected the phone to a computer USB for hours, also an original Apple wall charger for hours. Please see my above posts, I have changed the battery, checked the voltage of the battery and it is good.",
        "accepted": []
      },
      {
        "userName": "Kriptokrit",
        "postTime": "1341596818",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "Please follow those steps:Put your iPhone to DFU (Device Firmware Upgrade) Mode and try to restore it from iTunes. Follow the steps below to put your iPhone to DFU Mode:1. Connect the iPhone to your computer with the USB Cable.2. Open iTunes application on your computer3. On your iPhone Press and hold the Home button and the Sleep/Wake button at the same time.4. After exactly 8 seconds (when apple logo disappear) release the Sleep/Wake button. Continue holding the home button until your iTunes shows a message telling you that it has detected an iPhone.5. Click OK or Restore.Please note that in DFU Mode your iPhone will remain blank.If iTunes recognize your phone in recovery mode, please repeat the steps above to put your phone in DFU mode.Let me know if that works please. Thanks!",
        "accepted": []
      },
      {
        "userName": [],
        "postTime": "1341600418",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "Done that, the only difference is that when holding the Home button and Sleep/Wake button in your step 4. above the Apple Logo does not appear, no matter how long I hold them so released the Sleep/Wake button after 8 seconds (when the battery with red stripe and charging icon disappeared). iTunes saw the phone and restored it but when it goes to restart it only has the battery with the red stripe.",
        "accepted": []
      },
      {
        "userName": "Kriptokrit",
        "postTime": "1341600418",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "Sorry, I'm out of ideas. Let me open your question, so other Professional can try to assist you. As soon as another Professional is available he will contact you. You will receive an email notification when an Professional replies to you.Thanks for using our service.",
        "accepted": []
      },
      {
        "userName": "SVITExperts",
        "postTime": "1341600418",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "Hi and welcome,My name isXXXXX will assist you with your iPhone issues.So you already replaced the battery for your iphone? This issue started AFTER you replaced the battery correct?",
        "accepted": []
      },
      {
        "userName": [],
        "postTime": "1341600418",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "No the issue occurred before the battery was replaced, it looked like it was not charging so I replaced the docking connector assy and while it was apart I decided to replace the battery as the battery life was beginning to reduce. Prior to replacing the battery I tried the hardware reset but didn't make any difference. Plugging in the charger lead did not bring up the charging icon below the battery with red stripe. Now it does.",
        "accepted": []
      },
      {
        "userName": "SVITExperts",
        "postTime": "1341600418",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "Thanks so much for your info.Do you still have the old battery and old docking connector?I would ask you to take your phone apart, put the old battery and NEW docking connector. Test them.If not working, try NEW battery and OLD docking. Test them out. Thank you.",
        "accepted": []
      },
      {
        "userName": "SVITExperts",
        "postTime": "1341780418",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "Please let me know if you still need help. Thanks and have a great day!",
        "accepted": []
      },
      {
        "userName": [],
        "postTime": "1341928018",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "Hi, turns out it was a faulty new battery. Thanks",
        "accepted": []
      },
      {
        "userName": "SVITExperts",
        "postTime": "1341938818",
        "chatCustomer": [],
        "title": "Expert",
        "chatExpert": [],
        "content": "You are welcomed.Glad I could help. Please rate my answer so I can get credit.Thanks and have a great day!",
        "accepted": "Accepted Answer"
      }
    ],
    "question": {
      "category": "Smartphones",
      "status": "CLOSED",
      "title": "My iphone 3g will not turn on, plug in the charger and the",
      "value": "NZ$90",
      "content": "My iphone 3g will not turn on, plug in the charger and the red battery shows with the charging symbol. Tried replacing the battery and docking connector assy but still the same. The battery has 3.5v in it and have tried the hard reset but still the same, won't switch on the battery is always red. Also tried plugging into a computer with iTunes but it does not show. What could be the problem",
      "submitTime": "212 days and 14 hours ago.",
      "optionalInfo": "Optional Information: Product: iPhone"
    }
  }
]